// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
    // Console.Write("Введите трехзначное число: ");
    // int num = Convert.ToInt32(Console.ReadLine());
    
    // if (num < 100 || num > 999)
    // {
    //   Console.Write("Это не трехзначное число");
    // }
    // else
    // {
    // Console.Write(num/10%10);
    // }

    // Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
    // Console.Write("Введите число: ");
    // int num = Convert.ToInt32(Console.ReadLine());

    // if (num<100)
    // {
    //   Console.Write("Третьей цифры нет");
    // }
    // else
    // {
    //   while (num>999)
    //   {
    //     num = num/10;
    //   }
    //   Console.Write(num%100%10);
    // }

    // Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
//     Console.Write("Введите число от 1 до 7: ");
//     int date = Convert.ToInt32(Console.ReadLine());
//   if (date < 1 | date > 7)  
//   {
//     Console.WriteLine("введите от 1 до 7");
//   }
//   else 
//   {
//     if(date == 6 || date == 7)
//     { 
//       Console.WriteLine("это выходной");
//     }
//     else 
//     {
//       Console.WriteLine("это рабочий");
//     }
//   }